demos/library/src/main/resources/META-INF/SuggestionService.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:urn="urn:switchyard-quickstart-demo:library:1.0"
    targetNamespace="urn:switchyard-quickstart-demo:library:1.0"
    name="SuggestionService">
  <wsdl:types>
    <xsd:schema>
      <xsd:import namespace="urn:switchyard-quickstart-demo:library:1.0" schemaLocation="LibraryTypes.xsd"/>
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="suggestionRequest">
    <wsdl:part element="urn:suggestionRequest" name="parameters"/>
  </wsdl:message>
  <wsdl:message name="suggestionResponse">
    <wsdl:part element="urn:suggestionResponse" name="parameters"/>
  </wsdl:message>
  <wsdl:portType name="SuggestionService">
    <wsdl:operation name="suggestionRequest">
      <wsdl:input message="urn:suggestionRequest"/>
      <wsdl:output message="urn:suggestionResponse"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="SuggestionBinding" type="urn:SuggestionService">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="suggestionRequest">
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="SuggestionService">
    <wsdl:port binding="urn:SuggestionBinding" name="SuggestionBinding">
      <soap:address location="http://switchyard.org/library/suggestion"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
