release/karaf/tests/src/test/resources/quickstarts/demos/library/soap-request-6.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'><SOAP-ENV:Header></SOAP-ENV:Header><SOAP-ENV:Body><ns2:suggestionRequest xmlns:ns2="urn:switchyard-quickstart-demo:library:1.0">
    <keyword>Zombie</keyword>
</ns2:suggestionRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
